export type MemberInfo = {
  name: string;
  githubURL: string;
  profile_image: string;
  review: string;
};

export const DEVELOPERS_INFO: MemberInfo[] = [
  {
    name: '양희철',
    githubURL: 'https://github.com/heechul94',
    profile_image: '/images/희철님.jpeg',
    review:
      '일상 속에서 고민이었던 부분을 조금이나마 해소 할 수 있는 개발을 할 수 있어서 좋았습니다. 우리 팀이 어떻게 문제를 해결해줄지에 대한 기획과 어떻게 잘 보여줄까에 대한 디자인, 문제 해결을 구현하기 위한 개발 등 여러 요소가 어우러지려면 우리가 사용자들에게 무엇을 제공해줄지에 대한 부분이 명확해야 하는 것을 알게 되었습니다. 근 한 달 동안 팀원들과 좋은 경험 하였고 또 재밌는 주제로 개발하고 싶네요.'
  },
  {
    name: '이참',
    githubURL: 'https://github.com/ketchup0211',
    profile_image: '/images/참님.jpg',
    review: `2년전 친구들과 약속을 잡다 '이런 서비스가 있으면 좋지 않을까?' 하며 메모장에 적어두었던 아이디어가 이번 프로젝트를 기회로 세상에 나오게 되었습니다. 가벼운 마음으로 적은 아이디어인데, 이렇게 최종 프로젝트의 주제로 선정되어 많은 사람들 앞에 보여질 수 있는 실체가 되었다는 것에 참 감사한 것 같습니다. 처음으로 실제 유저들이 쓸 수 있는 서비스를 만들어봤고, 그 과정에서 많은 행복감을 느꼈습니다. 열정적이고 너무나도 좋은 팀원 분들 덕에, 그리고 애정을 가지고 있는 프로젝트인 덕에 행복하게 개발할 수 있었습니다. 저희 We 팀원 분들께 다시 한 번 감사 인사 전하고 싶습니다. 또한 개발 만을 진행하고 보수하며 서비스의 정체성이나, 유저 입장에서의 편의성을 잊어버릴 때가 종종 있었습니다. 그러나 중간중간 서비스 운영 및 홍보의 경험을 통해 프로젝트의 정체성을 굳건히 가져가도록 노력하고, 사용자의 입장을 고려하는 등 실무 개발에서 주의해야할 것에 대해 많이 알게 되었다고 생각합니다. 상상한 것을 현실로 만들고, 그것이 다른 분들의 일상에도 녹아들어간다면 개발자에게 그것만큼 행복한 일이 없는 것 같습니다. 이번 프로젝트를 시작으로 사람들의 일상 곳곳에 스며 변화를 줄 수 있는 개척자가 될 그날까지, 개발과 학문을 사랑하며 정진하는 이참이 되겠습니다. 감사합니다 :)`
  },
  {
    name: '나의찬',
    githubURL: 'https://github.com/lauichan',
    profile_image: '/images/의찬님.png',
    review:
      '이번 팀 프로젝트는 이전에 한번 기획했던 프로젝트를 발전시키는 것으로 시작되었습니다. 그럼에도 불구하고 기획하는데 가장 많은 시간을 쏟은 프로젝트였습니다. 많은 기능들을 생각하고 추가했지만 그러한 기능들이 이전 프로젝트에 비해 사용자 입장에서는 조금은 불친절한 기능들이어서 아쉬웠습니다. 향후 프로젝트를 유지보수하며 사용자를 배려하는 기능과 미처 추가하지 못한 기능들을 도전해볼 수 있다면 좋을 것 같습니다.'
  },
  {
    name: '박강토',
    githubURL: 'https://github.com/gidalim',
    profile_image: '/images/강토님.png',
    review:
      '경험은 무엇보다도 소중한 지식의 한 페이지입니다. 이번 프로젝트를 거치면서 부족했던 많은 점을 해결하고 문제를 다루고 대처하는 능력을 기를 수 있었습니다. 문제는 늘 발생하지만, 항상 외부에 의존하던 모습에서 스스로 처리할 수 있는 능동적인 개발자가 될 수 있는 초석이 되었습니다. 이제 우리는 스스로가 첫 발을 내딛을 일만 남았습니다.'
  },
  {
    name: '오소향',
    githubURL: 'https://github.com/SohyangO',
    profile_image: '/images/소향님.jpg',
    review:
      '실생활에서 사용할 수 있는 서비스를 직접 만들 수 있어서 뜻깊은 시간이었습니다. 프로젝트를 진행하면서 기획 단계에서 제공하고자 하는 것이 뚜렷해야 사용자들도 서비스에 있는 기능들을 명확하게 인지한다는 것을 알았습니다. 따라서 기능 구현에만 초점을 두는 것이 아닌, 사용자의 관점에서 한 번 더 생각해볼 수 있게 되었습니다. 좋은 팀원 분들 덕분에 개발을 대하는 태도와 문제 해결하는 방식까지 많이 배울 수 있어서 행복한 시간이었습니다. 감사합니다!!'
  }
];
